STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/calendar/app_calendar.c
/**
  ******************************************************************************
  * @file    app_calendar.c
  * @author  MCD Application Team
  * @brief   Calendar application implementation.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#ifndef __APP_CALENDAR_C
#define __APP_CALENDAR_C

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "stm32u575i_eval.h"
#include "stm32u575i_eval_lcd.h"
#include "app_calendar.h"
#include "k_config.h"
#include "k_module.h"
#include "k_menu.h"
#include "resources.h"
/* Private typedef ----------------------------------------------------------*/
/* Time Structure definition */
struct time_t
{
  uint8_t sec_l;
  uint8_t sec_h;
  uint8_t min_l;
  uint8_t min_h;
  uint8_t hour_l;
  uint8_t hour_h;
};
struct time_t time_struct;

/* Alarm Structure definition */
struct alarm_t
{
  uint8_t sec_l;
  uint8_t sec_h;
  uint8_t min_l;
  uint8_t min_h;
  uint8_t hour_l;
  uint8_t hour_h;
};
struct alarm_t alarm_struct;

/* Date Structure definition */
struct date_t
{
  uint8_t month;
  uint8_t day;
  uint16_t year;
};
struct date_t date_s;

extern tMenuItem psCurrentMenuItem;
extern __IO uint8_t AlarmStatus ;
static __IO uint8_t LedCounter = 0;
static uint32_t DateNb = 0;
static uint32_t wn = 0;
static uint32_t dn = 0;
static uint32_t dc = 0;
static uint16_t daycolumn = 0, dayline = 0;

const char DayNames[7][5] =
  {"Mon.", "Tue.", "Wed.", "Thu.", "Fri.", "Sat.", "Sun."
  };

const uint8_t MonLen[12] =
  {
    32, 29, 32, 31, 32, 31, 32, 32, 31, 32, 31, 32
  };
const char MonthNames[12][10] =
  {"JANUARY  ", "FEBRUARY ", "MARCH    ",
   "APRIL    ", "MAY      ", "JUNE     ",
   "JULY     ", "AUGUST   ", "SEPTEMBER",
   "OCTOBER  ", "NOVEMBER ", "DECEMBER "
  };

RTC_TimeTypeDef Time = {0};
RTC_DateTypeDef Date = {0};

/* Private constants ----------------------------------------------------------*/
#define DATE_LINE_NB                        2
#define TIME_LINE_NB                        3

/* Private function prototypes -----------------------------------------------*/
KMODULE_RETURN _CalendarDemoExec(void);
KMODULE_RETURN _CalendarConfig(void);
KMODULE_RETURN _CalendarExit(void);

void CalendarMenuUserAction(uint8_t sel);
void CalendarUserHeader(void);

static void Calendar_TimeRegulate(RTC_TimeTypeDef *TimeInput, RTC_TimeTypeDef *TimeOutput);
static void Calendar_TimePreAdjust(void);
static void Calendar_TimeSet(void);
static void Calendar_TimeShow(void);
static void Calendar_TimeDisplay(RTC_TimeTypeDef *time);
static void Calendar_DateRegulate(RTC_DateTypeDef *DateInput, RTC_DateTypeDef *DateOutput);
static void Calendar_DatePreAdjust(void);
static void Calendar_DateSet(void);
static void Calendar_DateShow(void);
static void Calendar_DateDisplay(uint8_t Year, uint8_t Month, uint8_t Day);
static void Calendar_AlarmPreAdjust(void);
static void Calendar_AlarmSet(void);
static void Calendar_AlarmDisable(void);
static void Calendar_ClearMenuLines(void);
static void Calendar_WeekDayNum(uint32_t nyear, uint8_t nmonth, uint8_t nday);
static uint8_t Calendar_IsLeapYear(uint16_t nYear);
static void Calendar_RegulateYear(uint8_t *Year, uint8_t *Month, uint8_t *Day);
static void Calendar_RegulateMonth(uint8_t *Year, uint8_t *Month, uint8_t *Day);
static void Calendar_RegulateDay(uint8_t *Year, uint8_t *Month, uint8_t *Day);
static void Calendar_TimePreAdjust(void);


/* Private Variable ----------------------------------------------------------*/
/* Time Menu */
const tMenuItem TimeMenuItems[] =
{
  {"Set"   , 14, 30, SEL_EXEC, MODULE_CALENDAR, Calendar_TimeSet, CalendarMenuUserAction, NULL, NULL, NULL  },
  {"Show"  , 14, 30, SEL_EXEC, MODULE_CALENDAR, Calendar_TimeShow , CalendarMenuUserAction, NULL, NULL, NULL  },
  {"Return", 14, 30, SEL_EXIT, MODULE_CALENDAR, NULL             , NULL                  , NULL, NULL, NULL  },
};
const tMenu TimeMenu = {"Time", TimeMenuItems, countof(TimeMenuItems), TYPE_TEXT, 1, 1 };

/* Date Menu */
const tMenuItem DateMenuItems[] =
{
  {"Set"   , 14, 30, SEL_EXEC, MODULE_CALENDAR, Calendar_DateSet, CalendarMenuUserAction, NULL, NULL, NULL  },
  {"Show"  , 14, 30, SEL_EXEC, MODULE_CALENDAR, Calendar_DateShow, CalendarMenuUserAction, NULL, NULL, NULL  },
  {"Return", 14, 30, SEL_EXIT, MODULE_CALENDAR, NULL             , NULL                  , NULL, NULL, NULL  },
};
const tMenu DateMenu = {"Date", DateMenuItems, countof(DateMenuItems), TYPE_TEXT, 1, 1 };

/* Alarm Menu */
const tMenuItem AlarmMenuItems[] =
{
  {"Set"    , 14, 30, SEL_EXEC, MODULE_CALENDAR, Calendar_AlarmSet    , CalendarMenuUserAction, NULL, NULL, NULL  },
  {"Disable", 14, 30, SEL_EXEC, MODULE_CALENDAR, Calendar_AlarmDisable, CalendarMenuUserAction, NULL, NULL, NULL  },
  {"Return" , 14, 30, SEL_EXIT, MODULE_CALENDAR, NULL                 , NULL                  , NULL, NULL, NULL  },
};
const tMenu AlarmMenu = {"Alarm", AlarmMenuItems, countof(AlarmMenuItems), TYPE_TEXT, 1, 1 };

/* Main Menu */
const tMenuItem CalendarMenuItems[] =
{
  {"Date"  , 14, 30, SEL_SUBMENU, MODULE_CALENDAR, NULL, NULL, (const tMenu*)&DateMenu, NULL, NULL  },
  {"Time"  , 14, 30, SEL_SUBMENU, MODULE_CALENDAR, NULL, NULL, (const tMenu*)&TimeMenu, NULL, NULL  },
  {"Alarm" , 14, 30, SEL_SUBMENU, MODULE_CALENDAR, NULL, NULL, (const tMenu*)&AlarmMenu, NULL, NULL  },
  {"Return", 14, 30, SEL_EXIT   , MODULE_NONE    , NULL, NULL, NULL                   , NULL, NULL  },
};
const tMenu CalendarMenu = {"Calendar", CalendarMenuItems, countof(CalendarMenuItems), TYPE_TEXT, 1, 1 };

/* Character usage */
uint8_t CharWidth;
uint8_t CharHeight;

