STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/calendar/app_calendar.c
/* used to exit application */
static __IO uint8_t UserEvent=0;
static __IO uint8_t UserAction=0;

/* Private typedef -----------------------------------------------------------*/
/* External variables --------------------------------------------------------*/
const K_ModuleItem_Typedef ModuleCalendar =
{
  MODULE_CALENDAR,
  _CalendarConfig,
  _CalendarDemoExec,
  _CalendarExit,
  NULL
};

/* RTC Handle variable */
extern RTC_HandleTypeDef RtcHandle;


/**
  * @brief  setup the HW for Calendar application
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _CalendarConfig(void)
{
  HAL_StatusTypeDef status = HAL_ERROR;

  /* HAL_RTC_Init has been already called for Backup reg access */
  /* check if Date has been already set one time, else configure it to
  1st of january 2019 */
  if(__HAL_RTC_GET_FLAG(&RtcHandle, RTC_FLAG_INITS) == 0x00u)
  {
    /* Set Date to 01.01.2019 */
    Date.Date = 0x01u;
    Date.Month = 0x01u;
    Date.Year = 0x19u;
    Date.WeekDay = RTC_WEEKDAY_MONDAY;

    /* Set time to default */
    Time.Hours = 0x00u;
    Time.Minutes = 0x00u;
    Time.Seconds = 0x00u;
    Time.TimeFormat = RTC_HOURFORMAT12_AM;

    /* Set the RTC current Time */
    status = HAL_RTC_SetTime(&RtcHandle, &Time, RTC_FORMAT_BCD);
    if(status != HAL_OK)
    {
      return KMODULE_ERROR_PRE;
    }

    /* Set the RTC current Date */
    HAL_RTC_SetDate(&RtcHandle, &Date, RTC_FORMAT_BCD);
    if(status != HAL_OK)
    {
      return KMODULE_ERROR_PRE;
    }
  }

  CharHeight = (((sFONT *)UTIL_LCD_GetFont())->Height);
  CharWidth = (((sFONT *)UTIL_LCD_GetFont())->Width);

  return KMODULE_OK;
}

/**
  * @brief  Run the application
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _CalendarDemoExec(void)
{
  /* App initialization    */
  kMenu_Execute(CalendarMenu);
  return KMODULE_OK;
}


/**
  * @brief  Run the applications
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _CalendarExit(void)
{
  return KMODULE_OK;
}


/**
  * @brief  Get User action
  * @param  sel   User selection (JOY_SEL,...)
  * @note   This example is the only way to get user information.
  * @retval None
  */
void CalendarMenuUserAction(uint8_t sel)
{
  if (UserAction == 0)
  {
    UserAction = 1;
  }
  /* store user event */
  UserEvent = sel;
}


/**
  * @brief  Adjusts time.
  * @param  None
  * @retval None
  */
static void Calendar_TimeSet(void)
{
  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* PreAdjust Time */
  Calendar_TimePreAdjust();
}


/**
  * @brief  Displays the current time.
  * @param  time current time
  * @retval None
  */
static void Calendar_TimeDisplay(RTC_TimeTypeDef *time)
{
  char showtime[14] = {0};

  sprintf((char*)showtime,"     %02X:%02X:%02X",time->Hours, time->Minutes, time->Seconds);
  UTIL_LCD_DisplayStringAtLine(TIME_LINE_NB, (uint8_t *) showtime);
}


/**
  * @brief  Displays information on LCD for the time configuration
  * @param  None
  * @retval None
  */
static void Calendar_TimePreAdjust(void)
{
  RTC_TimeTypeDef timecurrent = {0};
  RTC_TimeTypeDef timeset = {0};
  RTC_DateTypeDef dateset = {0};

  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timecurrent, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);

  /* Display the current time */
  Calendar_TimeDisplay(&timecurrent);

  /* Call Time selection function */
  Calendar_TimeRegulate(&timecurrent, &timeset);

  /* Set the RTC current Time */
  HAL_RTC_SetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Set the RTC current Date */
  HAL_RTC_SetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);
}


/**
  * @brief  Shows the current time (HH/MM/SS) on LCD.
  * @param  None
  * @retval None
  */
static void Calendar_TimeShow(void)
{
  uint32_t ypos = (CharHeight * (TIME_LINE_NB + 1));
  uint32_t xpos;
  uint32_t pXSize;
  RTC_TimeTypeDef time = {0};
  RTC_DateTypeDef date = {0};

  BSP_LCD_GetXSize(0, &pXSize);
  xpos =  (pXSize - 128) >> 1;
  UserAction = 0x00u;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  BSP_LCD_FillRGBRect(0, (uint32_t)xpos, (uint32_t)ypos, (uint8_t *)IconWatch, 128, 128);
  /* Wait a press on any JoyStick pushbuttons */
  while (UserAction == 0x00u)
  {
    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RtcHandle, &time, RTC_FORMAT_BCD);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RtcHandle, &date, RTC_FORMAT_BCD);

    /* Display current time */
    Calendar_TimeDisplay(&time);
  }
}


/**
  * @brief  Adjusts the current date (MM/DD/YYYY).
  * @param  None
  * @retval None
  */
static void Calendar_DateSet(void)
{
  /* Get back font specifications */
  UTIL_LCD_SetFont(&Font20);
  CharHeight = (((sFONT *)UTIL_LCD_GetFont())->Height);
  CharWidth = (((sFONT *)UTIL_LCD_GetFont())->Width);

  /* Clear the LCD */
  UTIL_LCD_Clear(UTIL_LCD_COLOR_WHITE);

  Calendar_DatePreAdjust();

  UTIL_LCD_SetFont(&Font24);
  CharHeight = (((sFONT *)UTIL_LCD_GetFont())->Height);
  CharWidth = (((sFONT *)UTIL_LCD_GetFont())->Width);

}


/**
  * @brief  Displays the date in graphic mode.
  * @param  Year    Year to display
  * @param  Month   Month to display
  * @param  Date    Date to display
  * @retval None
  */
static void Calendar_DateDisplay(uint8_t Year, uint8_t Month, uint8_t Day)
{
  uint32_t mline = 0, mcolumn = 319, month = 0;
  uint32_t monthlength = 0;
  char linedisplay[25];
  uint32_t pXSize;

  if (Month == 2)
  {
    if (Calendar_IsLeapYear(Year))
    {
      monthlength = 30;
    }
    else
    {
      monthlength = MonLen[Month - 1];
    }
  }
  else
  {
    monthlength = MonLen[Month - 1];
  }

  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_DrawRect(daycolumn, dayline, CharWidth*2, CharHeight-2, UTIL_LCD_COLOR_WHITE);

  /* Set the Back Color */
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_GetXSize(0, &pXSize);
  UTIL_LCD_FillRect(0, 0, pXSize, Font20.Height,UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_FillRect(0, LINE(1), pXSize, Font20.Height, UTIL_LCD_COLOR_ST_BLUE_DARK);
  /* Set the Text Color */
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);

