STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/calendar/app_calendar.c
  sprintf((char*)linedisplay,"    %s  20%02d     ", MonthNames[Month - 1], Year);
  UTIL_LCD_DisplayStringAtLine(0, (uint8_t*)linedisplay);

  /* Determines the week number, day of the week of the selected date */
  Calendar_WeekDayNum(Year, Month, Day);
  DateNb = dn;

  sprintf((char*)linedisplay," WEEK: %02lu   DAY: %03lu    ", (unsigned long)wn, (unsigned long)dc);
  UTIL_LCD_DisplayStringAtLine(1, (uint8_t*)linedisplay);

  /* Set the Back Color */
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_ST_GREEN_LIGHT);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_GREEN_LIGHT);
  UTIL_LCD_FillRect(0, LINE(2), pXSize, Font20.Height, UTIL_LCD_COLOR_ST_GREEN_LIGHT);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_DisplayStringAtLine(2, (uint8_t*) " Mo Tu We Th Fr Sa Su   ");
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);

  /* Determines the week number, day of the week of the selected date */
  Calendar_WeekDayNum(Year, Month, 1);

  /* Clear first & last calendar lines */
  UTIL_LCD_ClearStringLine(3);
  UTIL_LCD_ClearStringLine(7);
  UTIL_LCD_ClearStringLine(8);

  mline = LINE(3);
  mcolumn = ((CharWidth * 3) * dn);
  for (month = 1; month < monthlength; month++)
  {
    /* display first space */
    UTIL_LCD_DisplayChar(mcolumn, mline, ' ');
    mcolumn += CharWidth;

    if (month == Day)
    {
      daycolumn = mcolumn;
      dayline = mline;
    }

    if (month / 10)
    {
      UTIL_LCD_DisplayChar(mcolumn, mline, ((month / 10) + 0x30));
    }
    else
    {
      UTIL_LCD_DisplayChar(mcolumn, mline, ' ');
    }
    mcolumn += CharWidth;

    UTIL_LCD_DisplayChar(mcolumn, mline, ((month % 10) + 0x30));
    mcolumn += CharWidth;

    if (mcolumn >= ((7 * 3) * CharWidth))
    {
      mcolumn = 0;
      mline += CharHeight;
    }
  }

  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_GREEN_LIGHT);
  UTIL_LCD_DrawRect(daycolumn, dayline, CharWidth*2, CharHeight-2, UTIL_LCD_COLOR_ST_GREEN_LIGHT);
}


/**
  * @brief  Displays information on LCD for the time configuration
  * @param  None
  * @retval None
  */
static void Calendar_DatePreAdjust(void)
{
  RTC_DateTypeDef datecurrent = {0};
  RTC_DateTypeDef dateset = {0};
  RTC_TimeTypeDef timeset = {0};

  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &datecurrent, RTC_FORMAT_BCD);

  /* Call Time selection function */
  Calendar_DateRegulate(&datecurrent, &dateset);

  /* Set the RTC current Time */
  HAL_RTC_SetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Set the RTC current Date */
  HAL_RTC_SetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);
}


/**
  * @brief  Basically show date (MM/DD/YYYY).
  * @param  None
  * @retval None
  */
static void Calendar_DateShow(void)
{
  RTC_TimeTypeDef time = {0};
  RTC_DateTypeDef date = {0};
  char showdate[20] = {0};

  UserAction = 0x00u;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* Wait a press on any JoyStick pushbuttons */
  while (UserAction == 0x00u)
  {
    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RtcHandle, &time, RTC_FORMAT_BCD);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RtcHandle, &date, RTC_FORMAT_BCD);

    sprintf((char*)showdate," %s %02X.%02X.20%02X",DayNames[date.WeekDay - 1], date.Date, date.Month, date.Year);
    UTIL_LCD_DisplayStringAtLine(DATE_LINE_NB, (uint8_t *) showdate);

  }
}


/**
  * @brief  Set the time entered by user, using menu navigation keys.
  * @param  TimeInput     current time when entering function
  * @param  TimeOutput    value selected by user
  * @retval None
  */
static void Calendar_TimeRegulate(RTC_TimeTypeDef *TimeInput, RTC_TimeTypeDef *TimeOutput)
{
  uint16_t charwidth;
  uint8_t timearray[3];
  uint8_t rowarray[3];
  uint8_t index = 0;
  uint8_t digit = 0;
  char display[3];

  charwidth = UTIL_LCD_GetFont()->Width;
  rowarray[0] = 5 * charwidth;
  rowarray[1] = 8 * charwidth;
  rowarray[2] = 11 * charwidth;

  /* Initially display in red selected field */
  /* store time in array */
  timearray[0] = RTC_Bcd2ToByte(TimeInput->Hours);
  timearray[1] = RTC_Bcd2ToByte(TimeInput->Minutes);
  timearray[2] = RTC_Bcd2ToByte(TimeInput->Seconds);

  /* Display current digit in Red */
  digit = timearray[index];
  display[0] = ((digit / 10) + 0x30);
  display[1] = ((digit % 10) + 0x30);
  display[2] = (0x00);

  /* Set the Text Color */
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_PINK);

  /* Display new value */
  UTIL_LCD_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

  UserEvent = JOY_NONE;
  /* Endless loop */
  while (UserEvent != JOY_SEL)
  {
    if((UserEvent == JOY_UP) || (UserEvent == JOY_DOWN))
    {
      if(UserEvent == JOY_UP)
      {
        /* Increase current value */
        digit++;

        /* Handle hours , minutes, secondes overlap */
        if(((index == 0) && (digit > 23)) || (digit > 59))
        {
          digit = 0;
        }
      }

      if(UserEvent == JOY_DOWN)
      {
        /* Decrease current value */
        digit--;

        /* Handle hours , minutes, secondes overlap */
        if((index == 0) && (digit > 24))
        {
          digit = 23;
        }
        else if (digit > 60)
        {
          digit = 59;
        }
      }

      /* Display current digit in Red */
      display[0] = ((digit / 10) + 0x30);
      display[1] = ((digit % 10) + 0x30);

      /* Display new value */
      UTIL_LCD_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

      /* Store digit into local variable */
      timearray[index] = digit;

      /* Debounce */
      HAL_Delay(200);
      UserEvent = JOY_NONE;
    }

    if((UserEvent == JOY_RIGHT) || (UserEvent == JOY_LEFT))
    {
      /* Set the Text Color */
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);

      /* Display new value */
      UTIL_LCD_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

      /* Handle index following selection */
      if(UserEvent == JOY_RIGHT)
      {
        index++;
        if(index > 2)
        {
          index = 0;
        }
      }
      else
      {
        index--;
        if(index > 2)
        {
          index = 2;
        }
      }
      /* Set the Text Color */
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_PINK);

      /* Display current digit in Red */
      digit = timearray[index];
      display[0] = ((digit / 10) + 0x30);
      display[1] = ((digit % 10) + 0x30);

      /* Display new value */
      UTIL_LCD_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

      /* Debounce */
      HAL_Delay(200);
      UserEvent = JOY_NONE;
    }
  }

  /* store time in array */
  TimeOutput->Hours = RTC_ByteToBcd2(timearray[0]);
  TimeOutput->Minutes = RTC_ByteToBcd2(timearray[1]);
  TimeOutput->Seconds = RTC_ByteToBcd2(timearray[2]);
}



/**
  * @brief  Set date entered by user, using menu navigation keys.
  * @param  DateInput    current date when entering function
  * @param  DateOutput   value selected by user
  * @retval None
  */
static void Calendar_DateRegulate(RTC_DateTypeDef *DateInput, RTC_DateTypeDef *DateOutput)
{
  uint8_t year = RTC_Bcd2ToByte(DateInput->Year);
  uint8_t month = RTC_Bcd2ToByte(DateInput->Month);
  uint8_t day = RTC_Bcd2ToByte(DateInput->Date);

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

