STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/calendar/app_calendar.c
  /* Display the current time */
  Calendar_TimeDisplay(&timecurrent);

  /* Call Time selection function */
  Calendar_TimeRegulate(&timecurrent, &timeset);

  /* Get back alarm time */
  alarm.Alarm = RTC_ALARM_A;
  alarm.AlarmDateWeekDay = RTC_WEEKDAY_MONDAY;
  alarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
  alarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
  alarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
  alarm.AlarmTime.TimeFormat = RTC_HOURFORMAT12_AM;
  alarm.AlarmTime.Hours = timeset.Hours;
  alarm.AlarmTime.Minutes = timeset.Minutes;
  alarm.AlarmTime.Seconds = timeset.Seconds;

  /* Set the new alarm time */
  HAL_RTC_SetAlarm_IT(&RtcHandle, &alarm, RTC_FORMAT_BCD);

  /* Switch on Green Led used as Alarm indicator */
  BSP_LED_Toggle(LED_GREEN);
}


/**
  * @brief  Adjusts Alarm.
  * @param  None
  * @retval None
  */
static void Calendar_AlarmDisable(void)
{
  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* Deactivate alarm */
  HAL_RTC_DeactivateAlarm(&RtcHandle, RTC_ALARM_A);

  /* Alarm led off */
  BSP_LED_Off(LED_GREEN);

  /* Display information */
  UTIL_LCD_DisplayStringAtLine(TIME_LINE_NB, (uint8_t *)"Alarm is disabled");
  HAL_Delay(500);
}


/**
  * @brief  Alarm A callback function of the Irq Handler that makes led toggling
  * @param  None
  * @retval None
  */
void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc)
{
  uint32_t time = 0x40;
  __IO uint32_t period;

  while(time > 0)
  {
    BSP_LED_Toggle(LED_GREEN);

    /* waiting period */
    period = 0xFFFFF;
    while(period > 0)
    {
      period--;
    }

    /* decrease time */
    time--;
  }

  /* make sure led is off when leaving */
  BSP_LED_Off(LED_GREEN);
}


/**
  * @brief  Manage menu lines clearing
  * @param  None
  * @retval None
  */
static void Calendar_ClearMenuLines(void)
{
  /* Clear menu lines */
  UTIL_LCD_ClearStringLine(1);
  UTIL_LCD_ClearStringLine(2);
  UTIL_LCD_ClearStringLine(3);
}


/**
  * @brief  Determines the week number, the month number and the week day number.
  * @param  nyear   the week number
  * @param  nmonth  the month number
  * @param  nday    the week day number
  * @retval None
  */
static void Calendar_WeekDayNum(uint32_t nyear, uint8_t nmonth, uint8_t nday)
{
  uint32_t a = 0, b = 0, c = 0, s = 0, e = 0, f = 0, g = 0, d = 0;
  int32_t n = 0;
  if (nmonth < 3)
  {
    a = nyear - 1;
  }
  else
  {
    a = nyear;
  }

  b = (a / 4) - (a / 100) + (a / 400);
  c = ((a - 1) / 4) - ((a - 1) / 100) + ((a - 1) / 400);
  s = b - c;
  if (nmonth < 3)
  {
    e = 0;
    f =  nday - 1 + 31 * (nmonth - 1);
  }
  else
  {
    e = s + 1;
    f = nday + (153 * (nmonth - 3) + 2) / 5 + 58 + s;
  }
  g = (a + b) % 7;
  d = (f + g - e) % 7;
  n = f + 3 - d;
  if (n < 0)
  {
    wn = 53 - ((g - s) / 5);
  }
  else if (n > (364 + s))
  {
    wn = 1;
  }
  else
  {
    wn = (n / 7) + 1;
  }
  dn = d;
  dc = f + 1;
}


/**
  * @brief  Check whether the passed year is Leap or not.
  * @param  nYear  year number to be checked
  * @retval 1: leap year
  *         0: not leap year
  */
static uint8_t Calendar_IsLeapYear(uint16_t nYear)
{
  if (nYear % 4 != 0) return 0;
  if (nYear % 100 != 0) return 1;
  return (uint8_t)(nYear % 400 == 0);
}


#undef __APP_CALENDAR_C
#endif
